In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [76]:
df1 = pd.read_csv("train.csv")

In [77]:
df1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [78]:
df1.drop(['PassengerId',"Name","Ticket","Cabin"], axis = 1, inplace= True)

In [79]:
df1.shape

(891, 8)

In [80]:
df1.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [81]:
df1['Age'].fillna(df1['Age'].mean(),inplace = True)
df1['Embarked'].fillna(df1['Embarked'].mode()[0],inplace = True)

In [82]:
df1.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [83]:
l_sex_dummies = pd.get_dummies(df1['Sex'],drop_first=True)
df1 = pd.concat([df1,l_sex_dummies],axis = 1)

In [84]:
l_EB_dummies = pd.get_dummies(df1['Embarked'],drop_first=True)
df1 = pd.concat([df1,l_EB_dummies],axis = 1)

In [85]:
df1.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked  male  Q  S
0         0       3    male  22.0      1      0   7.2500        S     1  0  1
1         1       1  female  38.0      1      0  71.2833        C     0  0  0
2         1       3  female  26.0      0      0   7.9250        S     0  0  1
3         1       1  female  35.0      1      0  53.1000        S     0  0  1
4         0       3    male  35.0      0      0   8.0500        S     1  0  1

In [87]:
df1.drop(['Sex','Embarked'], axis = 1, inplace = True)

In [88]:
df1.head()

   Survived  Pclass   Age  SibSp  Parch     Fare  male  Q  S
0         0       3  22.0      1      0   7.2500     1  0  1
1         1       1  38.0      1      0  71.2833     0  0  0
2         1       3  26.0      0      0   7.9250     0  0  1
3         1       1  35.0      1      0  53.1000     0  0  1
4         0       3  35.0      0      0   8.0500     1  0  1

In [89]:
from sklearn.preprocessing import StandardScaler
sts = StandardScaler()

In [90]:
feature_scale = ['Age','Fare']
df1[feature_scale] = sts.fit_transform(df1[feature_scale])

In [91]:
df1.head()

   Survived  Pclass       Age  SibSp  Parch      Fare  male  Q  S
0         0       3 -0.592481      1      0 -0.502445     1  0  1
1         1       1  0.638789      1      0  0.786845     0  0  0
2         1       3 -0.284663      0      0 -0.488854     0  0  1
3         1       1  0.407926      1      0  0.420730     0  0  1
4         0       3  0.407926      0      0 -0.486337     1  0  1

In [92]:
X = df1.drop("Survived", axis = 1)

In [93]:
y = df1['Survived']

In [94]:
from sklearn.svm import SVC

In [117]:
model_svc = SVC()

In [118]:
model_svc.fit(X,y)

SVC()

In [119]:
df2 = pd.read_csv("test.csv")

In [120]:
df2.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [121]:
df3 = df2.drop(['PassengerId',"Name","Ticket","Cabin"], axis = 1)

In [122]:
df3.isnull().sum()

Pclass       0
Sex          0
Age         86
SibSp        0
Parch        0
Fare         1
Embarked     0
dtype: int64

In [123]:
df3['Age'].fillna(df3['Age'].mean(),inplace = True)
df3['Fare'].fillna(df3['Fare'].mean(),inplace = True)

In [124]:
l_sex_dummies = pd.get_dummies(df3['Sex'],drop_first=True)
df3 = pd.concat([df3,l_sex_dummies],axis = 1)

In [127]:
df3.drop(['Sex'],axis = 1 , inplace = True)

In [128]:
df3.head()

   Pclass   Age  SibSp  Parch     Fare  male
0       3  34.5      0      0   7.8292     1
1       3  47.0      1      0   7.0000     0
2       2  62.0      0      0   9.6875     1
3       3  27.0      0      0   8.6625     1
4       3  22.0      1      1  12.2875     0

In [129]:
df3[feature_scale] = sts.fit_transform(df3[feature_scale])

In [130]:
df3.head()

   Pclass       Age  SibSp  Parch      Fare  male
0       3  0.334993      0      0 -0.498407     1
1       3  1.325530      1      0 -0.513274     0
2       2  2.514175      0      0 -0.465088     1
3       3 -0.259330      0      0 -0.483466     1
4       3 -0.655545      1      1 -0.418471     0

In [131]:
y_predicted = model_svc.predict(df3)

ValueError: X.shape[1] = 6 should be equal to 8, the number of features at training time

In [115]:
sumbission = pd.DataFrame({
    'PassengerId':df2['PassengerId'],
    'Survived': y_predicted
})

In [116]:
sumbission.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         1

In [69]:
sumbission.to_csv("titanic_sumbit.csv", index = False)